src/Catalogs/Scan_ЗаказыНаЗавод/Scan_ЗаказыНаЗавод.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>Scan_ЗаказыНаЗавод</name>
  <comment>Предварительно справочник</comment>
  <attributes>
    <name>DDDeviation</name>
    <type>
      <types>CatalogRef.Scan_ПричиныОтклоненийПоDD</types>
    </type>
  </attributes>
  <attributes>
    <name>DDPriority</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>25</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>IDExternalSystem</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>36</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ГотовностьТС</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаБукингЛиста</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаОбновления</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ЕстьБукингЛист</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ЗаводскойСтатусЗаказа</name>
    <type>
      <types>CatalogRef.Scan_ЗаводскиеСтатусыЗаказаНаЗавод</types>
    </type>
  </attributes>
  <attributes>
    <name>Заказчик</name>
    <type>
      <types>CatalogRef.Scan_Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>ЗаказчикCOW</name>
    <type>
      <types>CatalogRef.Scan_Компании</types>
    </type>
  </attributes>
  <attributes>
    <name>ЗаказыНаЗакупкуOFMSПредставление</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ЗаказыНаЗакупкуПредставление</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>КодАдресаДоставки</name>
    <type>
      <types>CatalogRef.Scan_КодыАдресовДоставки</types>
    </type>
  </attributes>
  <attributes>
    <name>Кузовостроитель</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>200</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КузовщикиПредставление</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>МестоПроизводства</name>
    <type>
      <types>CatalogRef.Scan_МестаХранения</types>
    </type>
  </attributes>
  <attributes>
    <name>НапоминаниеДилерамОтправлено</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>НомерБукингЛиста</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>15</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПродавецЗаказчика</name>
    <type>
      <types>CatalogRef.Scan_Сотрудники</types>
    </type>
  </attributes>
  <attributes>
    <name>СозданВручную</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ЗаказыНаЗакупку</name>
    <attributes>
      <name>Кузовщик</name>
      <type>
        <types>CatalogRef.Scan_Контрагенты</types>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ЗаказНаЗакупку</name>
      <type>
        <types>String</types>
        <types>DocumentRef.Scan_ЗаказНаЗакупку</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Основной</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>ПорядковыйНомер</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>2</precision>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

src/InformationRegisters/Scan_НастройкиКлючевыхДатПоПользователям/Scan_НастройкиКлючевыхДатПоПользователям.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>Scan_НастройкиКлючевыхДатПоПользователям</name>
  <resources>
    <name>Использование</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <dimensions>
    <name>КлючеваяДата</name>
    <type>
      <types>EnumRef.Scan_КлючевыеДаты</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Пользователь</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

src/InformationRegisters/Scan_НастройкиКлючевыхДатЗаказаНаЗаводПоГруппамДат/Scan_НастройкиКлючевыхДатЗаказаНаЗаводПоГруппамДат.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>Scan_НастройкиКлючевыхДатЗаказаНаЗаводПоГруппамДат</name>
  <resources>
    <name>ДоступностьДилеру</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>Производство</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>Надстройка</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>Логистика</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>Отгрузка</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <dimensions>
    <name>КлючеваяДата</name>
    <type>
      <types>EnumRef.Scan_КлючевыеДаты</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

src/InformationRegisters/Scan_КлючевыеДатыПроцессов/Scan_КлючевыеДатыПроцессов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>Scan_КлючевыеДатыПроцессов</name>
  <informationRegisterPeriodicity>Second</informationRegisterPeriodicity>
  <resources>
    <name>Значение</name>
    <type>
      <types>Date</types>
    </type>
  </resources>
  <attributes>
    <name>Пользователь</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>НомерНакладной1ДБ</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>GUIDНакладной1ДБ</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>36</length>
      </stringQualifiers>
    </type>
  </attributes>
  <dimensions>
    <name>ОбъектКлючевойДаты</name>
    <type>
      <types>EnumRef.Scan_ОбъектыКлючевыхДат</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Объект</name>
    <type>
      <types>CatalogRef.Scan_Изделия</types>
      <types>CatalogRef.Scan_ЗаказыНаЗавод</types>
      <types>String</types>
      <stringQualifiers>
        <length>15</length>
      </stringQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>ВидКлючевойДаты</name>
    <type>
      <types>EnumRef.Scan_КлючевыеДаты</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

src/InformationRegisters/Scan_ЗакреплениеМенеджеровЗаЗаказамиНаЗавод/Scan_ЗакреплениеМенеджеровЗаЗаказамиНаЗавод.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>Scan_ЗакреплениеМенеджеровЗаЗаказамиНаЗавод</name>
  <informationRegisterPeriodicity>Second</informationRegisterPeriodicity>
  <resources>
    <name>Менеджер</name>
    <type>
      <types>CatalogRef.Scan_Сотрудники</types>
    </type>
  </resources>
  <attributes>
    <name>Пользователь</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <dimensions>
    <name>ЗаказНаЗавод</name>
    <type>
      <types>CatalogRef.Scan_ЗаказыНаЗавод</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

src/InformationRegisters/Scan_ВзаимосвязьКомпанийСКонтрагентами/Scan_ВзаимосвязьКомпанийСКонтрагентами.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>Scan_ВзаимосвязьКомпанийСКонтрагентами</name>
  <informationRegisterPeriodicity>Second</informationRegisterPeriodicity>
  <attributes>
    <name>Пользователь</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>ДокументИзмененияВ1БД</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>РежимУстановкиВидаВзаимодействия</name>
    <type>
      <types>EnumRef.Scan_РежимУстановкиВидаВзаимодействия</types>
    </type>
  </attributes>
  <dimensions>
    <name>Компания</name>
    <type>
      <types>CatalogRef.Scan_Компании</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Контрагент</name>
    <type>
      <types>CatalogRef.Scan_Контрагенты</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ВидВзаимодействия</name>
    <type>
      <types>CatalogRef.Scan_ВидыВзаимодействий</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

src/InformationRegisters/Scan_ЗакреплениеМенеджеровЗаДилерами/Scan_ЗакреплениеМенеджеровЗаДилерами.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>Scan_ЗакреплениеМенеджеровЗаДилерами</name>
  <informationRegisterPeriodicity>RecorderPosition</informationRegisterPeriodicity>
  <writeMode>RecorderSubordinate</writeMode>
  <resources>
    <name>Менеджер</name>
    <type>
      <types>CatalogRef.Scan_Сотрудники</types>
    </type>
  </resources>
  <attributes>
    <name>Пользователь</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <dimensions>
    <name>Дилер</name>
    <type>
      <types>CatalogRef.Scan_Компании</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

src/InformationRegisters/Scan_КвотыSOrderFFUФакт/Scan_КвотыSOrderFFUФакт.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>Scan_КвотыSOrderFFUФакт</name>
  <resources>
    <name>Опция</name>
    <type>
      <types>CatalogRef.Scan_ОпцииПродуктов</types>
    </type>
  </resources>
  <dimensions>
    <name>ЗаказНаЗавод</name>
    <type>
      <types>CatalogRef.Scan_ЗаказыНаЗавод</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ТипОпции</name>
    <type>
      <types>CatalogRef.Scan_ТипыОпций</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

src/InformationRegisters/Scan_ВзаимосвязьИзделийИЗаказов/Scan_ВзаимосвязьИзделийИЗаказов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>Scan_ВзаимосвязьИзделийИЗаказов</name>
  <informationRegisterPeriodicity>Second</informationRegisterPeriodicity>
  <resources>
    <name>ЗаказНаЗавод</name>
    <type>
      <types>CatalogRef.Scan_ЗаказыНаЗавод</types>
    </type>
  </resources>
  <attributes>
    <name>Пользователь</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <dimensions>
    <name>Изделие</name>
    <type>
      <types>CatalogRef.Scan_Изделия</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

src/InformationRegisters/Scan_ЛичныеКомментарииПользователей/Scan_ЛичныеКомментарииПользователей.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>Scan_ЛичныеКомментарииПользователей</name>
  <resources>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </resources>
  <dimensions>
    <name>Пользователь</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ЗаказНаЗавод</name>
    <type>
      <types>CatalogRef.Scan_ЗаказыНаЗавод</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

src/Catalogs/Scan_ЗаказыНаЗавод/Forms/ФормаЭлемента/Module.bsl
// Модуль формы элемента справочника "Заказы на завод (scania)"																									
																									
////////////////////////////////////////////////////////////////////////////////																									
// СЛУЖЕБНЫЕ ПРОЦЕДУРЫ И ФУНКЦИИ																									
																									

&НаСервере
Процедура УправлениеДиалогомНаСервере()
	//rarus sergei 06.07.2016 mantis 6929 ++

	
	//Изменения, связанные с продуктом
	//Элементы.ПродуктДатаГотовности.Доступность = Объект.ПродуктГотов; //rarus BProg_Dekin 29.10.2019 0014452 +- Удалил обработку реквизита "ПродуктДатаГотовности"
	
	//Изменения, связанные с букинг-листом
	Элементы.ДатаБукингЛиста.Доступность = Объект.ЕстьБукингЛист;
	Элементы.НомерБукингЛиста.Доступность = Объект.ЕстьБукингЛист;
	
	//rarus tenkam 18.10.2016 mantis 6897 ++
	Элементы.ФормаГруппаИнтеграция.Видимость = Scan_ПраваИНастройки.Scan_Право("ОбменСПредставительством");
	Элементы.ФормаОбновитьЭлемент.Доступность = (ЗначениеЗаполнено(Объект.IDExternalSystem));
	
	Если ЗначениеЗаполнено(Объект.ДатаОбновления) Тогда
		Элементы.ФормаОбновитьЭлемент.Заголовок = Объект.ДатаОбновления;
	КонецЕсли;
	//rarus tenkam 18.10.2016 mantis 6897 --
	
	// rarus agar 25.05.2021 16927 ++
	//rarus abrant 18.04.2017 mantis 9380 +++
	//Элементы.ГруппаШапка.ТолькоПросмотр = НЕ Scan_ПраваИНастройки.Scan_Право("РазрешатьРедактироватьПараметрыЗаказаНаЗавод");
	//Элементы.Комментарий.ТолькоПросмотр = НЕ Scan_ПраваИНастройки.Scan_Право("РазрешатьРедактироватьПараметрыЗаказаНаЗавод");
	//rarus abrant 18.04.2017 mantis 9380 +++
	
	РазрешатьРедактироватьПараметрыЗаказаНаЗавод = Scan_ПраваИНастройки.Scan_Право("РазрешатьРедактироватьПараметрыЗаказаНаЗавод");
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "ГруппаШапка", "ТолькоПросмотр", Не РазрешатьРедактироватьПараметрыЗаказаНаЗавод);
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "Комментарий", "ТолькоПросмотр", Не РазрешатьРедактироватьПараметрыЗаказаНаЗавод);	
	// rarus agar 25.05.2021 16927 --

	//rarus BProg_Dekin 14.11.2019 0014452 ++ Разрешить редактирование параметров заказ-наряда
	РазрешатьРедактироватьПараметрыЗаказаНаЗавод = Scan_ПраваИНастройки.Scan_Право("РазрешатьРедактироватьПараметрыЗаказаНаЗавод");
	Элементы.ГруппаСопСцДрайв.ТолькоПросмотр 	= НЕ РазрешатьРедактироватьПараметрыЗаказаНаЗавод;
	Элементы.ГруппаСтраницы.ТолькоПросмотр		= НЕ РазрешатьРедактироватьПараметрыЗаказаНаЗавод;
	//rarus BProg_Dekin 14.11.2019 0014452 --
	
	// rarus tenkam 24.04.2019 mantis 14223 +++
	ТекЗаводскойСтатусЗаказа = Строка(Объект.ЗаводскойСтатусЗаказа.СтатусCOW) + "," + Объект.ЗаводскойСтатусЗаказа.Наименование;
	// rarus tenkam 24.04.2019 mantis 14223 ---
	
	// rarus tenkam 13.05.2019 mantis 14226 +++
	//rarus bonmak 15.08.2019 14576 ++
	//Элементы.СтатусЗаказа.ТолькоПросмотр = НЕ ((ТипЗаказа = Перечисления.Scan_ТипыЗаказовНаЗавод.OpenOrder 
	//										ИЛИ ТипЗаказа = Перечисления.Scan_ТипыЗаказовНаЗавод.AOrder) 
	//										И Scan_ПраваИНастройки.Scan_Право("РазрешатьИзменениеСтатусовЗаказовНаЗавод"));	
	//Элементы.СтатусЗаказаЛокальный.ТолькоПросмотр = НЕ Scan_ПраваИНастройки.Scan_Право("РазрешатьИзменениеСтатусовЗаказовНаЗавод"); //rarus BProg_Dekin 18.05.2020 mantis 0015999 +-
	//rarus bonmak 15.08.2019 14576 --
	// rarus tenkam 13.05.2019 mantis 14226 ---
	
	//rarus BProg_Dekin 30.10.2019 0014452 ++ Видимость элементов формы	
	ОтобразитьКолонкиКлючевыхДат();
	
	ПользовательЯвляетсяСотрудникомСканияРусь	= Scan_ПраваИНастройки.Scan_Право("ПользовательЯвляетсяСотрудникомСканияРусь");
	
	Элементы.ФормаИзбранное.Видимость 			= ПользовательЯвляетсяСотрудникомСканияРусь; 
	Элементы.СтраницаПроизводство.Видимость 	= ПользовательЯвляетсяСотрудникомСканияРусь;
	Элементы.СтраницаНадстройка.Видимость 		= ПользовательЯвляетсяСотрудникомСканияРусь;
	Элементы.СтраницаЛогистика.Видимость 		= ПользовательЯвляетсяСотрудникомСканияРусь;
	Элементы.СтраницаОтгрузка.Видимость 		= ПользовательЯвляетсяСотрудникомСканияРусь;
	Элементы.СтраницаКлючевыеДаты.Видимость		= НЕ ПользовательЯвляетсяСотрудникомСканияРусь;
	
	Элементы.СтраницаСистемныеПоля.Видимость 	= Scan_ПраваИНастройки.Scan_Право("ОтображатьЗакладкуСистемныеПоляВЗаказеНаЗавод");
	Элементы.ПроизводствоКлючевыеДаты.Видимость	= Scan_ПраваИНастройки.Scan_Право("ОтображатьКлючевыеДатыГруппыПроизводствоВЗаказеНаЗавод");
	Элементы.НадстройкаКлючевыеДаты.Видимость	= Scan_ПраваИНастройки.Scan_Право("ОтображатьКлючевыеДатыГруппыНадстройкаВЗаказеНаЗавод");
	Элементы.ЛогистикаКлючевыеДаты.Видимость	= Scan_ПраваИНастройки.Scan_Право("ОтображатьКлючевыеДатыГруппыЛогистикаВЗаказеНаЗавод");
	Элементы.ОтгрузкаКлючевыеДаты.Видимость		= Scan_ПраваИНастройки.Scan_Право("ОтображатьКлючевыеДатыГруппыОтгрузкаВЗаказеНаЗавод");
	
	Если ПользовательЯвляетсяСотрудникомСканияРусь Тогда
		ОграничитьДоступностьИзмененияКлючевойДаты(Элементы.ПроизводствоКлючевыеДаты.Имя);
		ОграничитьДоступностьИзмененияКлючевойДаты(Элементы.НадстройкаКлючевыеДаты.Имя);
		ОграничитьДоступностьИзмененияКлючевойДаты(Элементы.ЛогистикаКлючевыеДаты.Имя);
		ОграничитьДоступностьИзмененияКлючевойДаты(Элементы.ОтгрузкаКлючевыеДаты.Имя);
	Иначе
		ОграничитьДоступностьИзмененияКлючевойДаты(Элементы.ОтгрузкаКлючевыеДаты.Имя);
	КонецЕсли;
	//rarus BProg_Dekin 30.10.2019 0014452 --
	
	//rarus ozhnik 14927 17.02.2020 + 
	Если Объект.Заказчик = ПредопределенноеЗначение("Справочник.Scan_Контрагенты.СканияРусь") Тогда
		Элементы.ЗакрепленныйМенеджер.КнопкаВыпадающегоСписка = Истина;
		//rarus anch 14927 27.04.2020 +
		//Элементы.ЗакрепленныйМенеджер.ТолькоПросмотр = истина;
		Элементы.ЗакрепленныйМенеджер.ТолькоПросмотр = Ложь;
		//rarus anch 14927 27.04.2020 -
	Иначе
		Элементы.ЗакрепленныйМенеджер.КнопкаВыпадающегоСписка = ложь;
		//rarus anch 14927 27.04.2020 +
		//Элементы.ЗакрепленныйМенеджер.ТолькоПросмотр = ложь;
		Элементы.ЗакрепленныйМенеджер.ТолькоПросмотр = истина;
		//rarus anch 14927 27.04.2020 -
	КонецЕсли; 	
	//rarus ozhnik 14927 17.02.2020 -
	
	//rarus vikhle 19.10.2020 mt 16328 +++
	РазрешеноРедактированиеДатПоНадстройкам = Scan_ПраваИНастройки.Scan_Право("РазрешатьРедактироватьДатыПоНадстройкам"); 
	//Элементы.ГотовностьТС.ТолькоПросмотр = НЕ Scan_ПраваИНастройки.Scan_Право("РазрешатьРедактироватьДатыПоНадстройкам"); //rarus BProg_Dekin 04.03.2020 mantis 0015725 +-
	Элементы.ГотовностьТС.ТолькоПросмотр = НЕ РазрешеноРедактированиеДатПоНадстройкам;  
	Элементы.ЗаказыНаЗакупкуОсновной.ТолькоПросмотр = НЕ РазрешеноРедактированиеДатПоНадстройкам; 
	//rarus vikhle 19.10.2020 mt 16328 ---
	
	//rarus vikhle 16.09.2020 mt 16526 +++ 
	//Элементы.Кузовостроитель.ТолькоПросмотр = НЕ Scan_ПраваИНастройки.Scan_Право("РазрешитьИзменятьКузовостроителя"); //rarus agar 09.11.2020 16526 +-
	
	//rarus agar 19.01.2021 16981 ++
	//ТипСНадстройкой = Справочники.Scan_ТипыПродуктов.ПолучитьПризнакНаличияНастройки(Изделие.ТипПродукта);
	//Если ТипСНадстройкой = Неопределено Тогда
	//	Элементы.СкладОтгрузки.ТолькоПросмотр = Истина;
	//ИначеЕсли ТипСНадстройкой Тогда
	//	Элементы.СкладОтгрузки.ТолькоПросмотр = НЕ Scan_ПраваИНастройки.Scan_Право("РазрешитьИзменятьСкладОтгрузкиДляПродуктовСНадстройкой");
	//ИначеЕсли НЕ ТипСНадстройкой Тогда
	//	Элементы.СкладОтгрузки.ТолькоПросмотр = НЕ Scan_ПраваИНастройки.Scan_Право("РазрешитьИзменятьСкладОтгрузкиДляПродуктовБезНадстройки");	
	//КонецЕсли;
	//rarus agar 19.01.2021 16981 --
	//rarus vikhle 16.09.2020 mt 16526 ---
	
	//rarus vikhle 20.10.2020 mt 16328 +++
	Элементы.DDPriority.ТолькоПросмотр	= НЕ Scan_ПраваИНастройки.Scan_Право("РазрешитьРедактироватьDDPriorityВЗаказеНаЗавод");  
	Элементы.DDDeviation.ТолькоПросмотр = НЕ Scan_ПраваИНастройки.Scan_Право("РазрешитьРедактироватьDDDeviationВЗаказеНаЗавод");
	//rarus vikhle 20.10.2020 mt 16328 ---
	
	// rarus agar 13.11.2020 16526 ++
	//rarus agar 19.01.2021 16981 ++
	//Элементы.ЗапретНаИзменениеСкладаОтгрузки.ТолькоПросмотр = Не Scan_ПраваИНастройки.Scan_Право("РазрешатьУстанавливатьЗапретНаИзменениеСкладаОтгрузки");
	//rarus agar 19.01.2021 16981 --
	// rarus agar 13.11.2020 16526 --
	
КонецПроцедуры  

&НаСервере
Процедура ОтобразитьКолонкиКлючевыхДат() //rarus BProg_Dekin 31.10.2019 0014452 +- Видимость колонок табличной части
	//Видимость колонок ключевых дат
	ОбъектКлючевыхДат = Перечисления.Scan_ОбъектыКлючевыхДат.ЗаказНаЗавод;
	ИменаНастроеек = СтрРазделить("ДоступностьДилеру, Производство, Надстройка, Логистика, Отгрузка", ", ", Ложь);
	
	НастройкиПользователя = РегистрыСведений.Scan_НастройкиКлючевыхДатПоПользователям.ПолучитьНастройки(ОбъектКлючевыхДат);
	
	НастройкиПоГруппамДат = РегистрыСведений.Scan_НастройкиКлючевыхДатЗаказаНаЗаводПоГруппамДат.ПолучитьНастройки(ОбъектКлючевыхДат);
	Для каждого Строка Из НастройкиПоГруппамДат Цикл
		Если НастройкиПользователя.Найти(Строка.КлючеваяДата).Использование <> Неопределено тогда
			Для Каждого ИмяНастройки из ИменаНастроеек цикл
				Строка[ИмяНастройки] = НастройкиПользователя.Найти(Строка.КлючеваяДата).Использование;
			КонецЦикла;
		КонецЕсли;
	КонецЦикла; 
	
	Для Каждого ИмяНастройки из ИменаНастроеек цикл
		ИмяЭлементаТабличнойЧасти = ?(ИмяНастройки = "ДоступностьДилеру", "КлючевыеДаты", ИмяНастройки + "КлючевыеДаты");
			
		Для Каждого Строка Из НастройкиПоГруппамДат Цикл
			ИмяВидаКлючевойДаты = XMLСтрока(Строка.КлючеваяДата);
			ИмяЭлементаКолонки = ИмяЭлементаТабличнойЧасти + ИмяВидаКлючевойДаты;
			ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, ИмяЭлементаКолонки, "Видимость", Строка[ИмяНастройки]);	
		КонецЦикла;	
	КонецЦикла;
КонецПроцедуры

&НаСервере
Процедура НастроитьОтборыДинамическихСписков()
	Если НЕ ЗначениеЗаполнено(Объект.Ссылка) Тогда
		
		//УДАЛИТЬ (7219)++
		////Местоположение
		//ЭлементОтбора = ОстаткиПродуктовНаПлощадках.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
		//ЭлементОтбора.ЛевоеЗначение    = Новый ПолеКомпоновкиДанных("Продукт");
		//ЭлементОтбора.ВидСравнения     = ВидСравненияКомпоновкиДанных.Равно;
		//ЭлементОтбора.Использование    = Истина;
		//ЭлементОтбора.ПравоеЗначение   = Справочники.Scan_Изделия.ПустаяСсылка();
		//УДАЛИТЬ (7219)--
		
		
		////Документы
		////rarus sergei ++
		////СписокДокументов.Параметры.УстановитьЗначениеПараметра ("ИскомаяКарточкаЗаказа", Справочники.Scan_КарточкаЗаказа.ПустаяСсылка());
		//СписокДокументов.Параметры.УстановитьЗначениеПараметра ("ИскомыйПродукт", Справочники.Scan_Изделия.ПустаяСсылка());
		////rarus serfei --
		
		////Контрольные точки
		//ЭлементОтбора = ЛогКонтрольныхТочек.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
		//ЭлементОтбора.ЛевоеЗначение    = Новый ПолеКомпоновкиДанных("КарточкаЗаказа");
		//ЭлементОтбора.ВидСравнения     = ВидСравненияКомпоновкиДанных.Равно;
		//ЭлементОтбора.Использование    = Истина;
		//ЭлементОтбора.ПравоеЗначение   = Справочники.Scan_ЗаказыНаЗавод.ПустаяСсылка();
		
	Иначе
		
		//УДАЛИТЬ (7219)++
		////Местополоение
		//ЭлементОтбора = ОстаткиПродуктовНаПлощадках.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
		//ЭлементОтбора.ЛевоеЗначение    = Новый ПолеКомпоновкиДанных("Продукт");
		//ЭлементОтбора.ВидСравнения     = ВидСравненияКомпоновкиДанных.Равно;
		//ЭлементОтбора.Использование    = Истина;
		//ЭлементОтбора.ПравоеЗначение   = Объект.Продукт;
		//УДАЛИТЬ (7219) --
		
		//Документы		
		//СписокДокументов.Параметры.УстановитьЗначениеПараметра ("ИскомаяКарточкаЗаказа", Объект.Ссылка);
		
		//Контрольные точки
		//rarus BProg_Dekin 04.11.2019 0014452 ++ Удалил логи контрольных точек
		//ЭлементОтбора = ЛогКонтрольныхТочек.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
		//ЭлементОтбора.ЛевоеЗначение    = Новый ПолеКомпоновкиДанных("ЗаказНаЗавод");
		//ЭлементОтбора.ВидСравнения     = ВидСравненияКомпоновкиДанных.Равно;
		//ЭлементОтбора.Использование    = Истина;
		//ЭлементОтбора.ПравоеЗначение   = Объект.Ссылка;
		//rarus BProg_Dekin 04.11.2019 0014452 --
	КонецЕсли;
	
КонецПроцедуры

// rarus tenkam 24.05.2019 mantis 14224 +++
&НаСервере
Процедура ОбновитьКлючевыеДаты()
	//rarus BProg_Dekin 31.10.2019 0014452 ++ ОбновитьКлючевыеДаты
	КлючевыеДаты.Очистить();
	СтрокаКлючевыеДаты = КлючевыеДаты.Добавить();
	ЗаполнитьЗначенияСвойств(СтрокаКлючевыеДаты, РегистрыСведений.Scan_КлючевыеДатыПроцессов.КлючевыеДатыОбъекта(Объект.Ссылка)); 
	ЗаполнитьЗначенияСвойств(СтрокаКлючевыеДаты, РегистрыСведений.Scan_КлючевыеДатыПроцессов.КлючевыеДатыОбъекта(Изделие)); 
	
	//ОбъектКлючевойДаты = Перечисления.Scan_ОбъектыКлючевыхДат.ЗаказНаЗавод;
	//МассивПеречислений = Перечисления.Scan_КлючевыеДаты.ПолучитьМассивПеречисленийПоОбъекту(ОбъектКлючевойДаты);
	//
	//Запрос = Новый Запрос;
	//Запрос.Текст = 
	//	"ВЫБРАТЬ
	//	|	Scan_КлючевыеДаты.Ссылка КАК ВидКлючевойДаты
	//	|ПОМЕСТИТЬ ВсеКлючевыеДатыОбъекта
	//	|ИЗ
	//	|	Перечисление.Scan_КлючевыеДаты КАК Scan_КлючевыеДаты
	//	|ГДЕ
	//	|	Scan_КлючевыеДаты.Ссылка В(&МассивПеречислений)
	//	|;
	//	|
	//	|////////////////////////////////////////////////////////////////////////////////
	//	|ВЫБРАТЬ
	//	|	ВсеКлючевыеДатыОбъекта.ВидКлючевойДаты КАК ВидКлючевойДаты,
	//	|	ЕСТЬNULL(Scan_КлючевыеДатыПроцессовСрезПоследних.Значение, ДАТАВРЕМЯ(1, 1, 1)) КАК Значение
	//	|ИЗ
	//	|	ВсеКлючевыеДатыОбъекта КАК ВсеКлючевыеДатыОбъекта
	//	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.Scan_КлючевыеДатыПроцессов.СрезПоследних(
	//	|				,
	//	|				Объект = &Ссылка
	//	|					И ОбъектКлючевойДаты = &ОбъектКлючевойДаты) КАК Scan_КлючевыеДатыПроцессовСрезПоследних
	//	|		ПО ВсеКлючевыеДатыОбъекта.ВидКлючевойДаты = Scan_КлючевыеДатыПроцессовСрезПоследних.ВидКлючевойДаты";
	//
	//Запрос.УстановитьПараметр("МассивПеречислений", МассивПеречислений);
	//Запрос.УстановитьПараметр("ОбъектКлючевойДаты", ОбъектКлючевойДаты);
	//Запрос.УстановитьПараметр("Ссылка", Объект.Ссылка);
	//
	//РезультатЗапроса = Запрос.Выполнить();
	//
	//ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	//Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
	//	НоваяСтрока = КлючевыеДаты.Добавить();
	//	ЗаполнитьЗначенияСвойств(НоваяСтрока, ВыборкаДетальныеЗаписи);
	//КонецЦикла;

	//rarus BProg_Dekin 31.10.2019 0014452 --
	
КонецПроцедуры             

// rarus tenkam 06.11.2020 mantis 16673 +++			
//&НаСервереБезКонтекста
//Функция ПолучитьНастройкуДляLDD()
//	Возврат Scan_ПраваИНастройки.Scan_Право("КоличествоДнейДляРасчетаLDD");
//КонецФункции
// rarus tenkam 06.11.2020 mantis 16673 ---			

// rarus tenkam 24.05.2019 mantis 14224 ---

//rarus ozhnik 14927 17.02.2020 + 
Процедура ВывестиОтветственногоМенеджера()
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	Scan_ЗакреплениеМенеджеровЗаЗаказамиНаЗаводСрезПоследних.Менеджер КАК Менеджер
		|ИЗ
		|	РегистрСведений.Scan_ЗакреплениеМенеджеровЗаЗаказамиНаЗавод.СрезПоследних(, ЗаказНаЗавод = &Ссылка) КАК Scan_ЗакреплениеМенеджеровЗаЗаказамиНаЗаводСрезПоследних";
	
	Запрос.УстановитьПараметр("Ссылка", Объект.Ссылка);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Если ВыборкаДетальныеЗаписи.Следующий() Тогда
		ЗакрепленныйМенеджер = ВыборкаДетальныеЗаписи.Менеджер; 		
	Иначе
		Запрос = Новый Запрос;
		Запрос.Текст = 
			"ВЫБРАТЬ
			|	Scan_ВзаимосвязьКомпанийСКонтрагентамиСрезПоследних.Компания КАК Компания
			|ПОМЕСТИТЬ ВТ_Дилер
			|ИЗ
			|	Справочник.Scan_ЗаказыНаЗавод КАК Scan_ЗаказыНаЗавод
			|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.Scan_ВзаимосвязьКомпанийСКонтрагентами.СрезПоследних КАК Scan_ВзаимосвязьКомпанийСКонтрагентамиСрезПоследних
			|		ПО Scan_ЗаказыНаЗавод.Заказчик = Scan_ВзаимосвязьКомпанийСКонтрагентамиСрезПоследних.Контрагент
			|ГДЕ
			|	Scan_ЗаказыНаЗавод.Ссылка = &Ссылка
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ
			|	Scan_ЗакреплениеМенеджеровЗаДилерамиСрезПоследних.Менеджер КАК Менеджер
			|ИЗ
			|	ВТ_Дилер КАК ВТ_Дилер
			|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.Scan_ЗакреплениеМенеджеровЗаДилерами.СрезПоследних КАК Scan_ЗакреплениеМенеджеровЗаДилерамиСрезПоследних
			|		ПО ВТ_Дилер.Компания = Scan_ЗакреплениеМенеджеровЗаДилерамиСрезПоследних.Дилер";
		запрос.УстановитьПараметр("Ссылка", Объект.Ссылка);
		РезультатЗапроса = Запрос.Выполнить();
		
		ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
		
		Если ВыборкаДетальныеЗаписи.Следующий() тогда
			ЗакрепленныйМенеджер = ВыборкаДетальныеЗаписи.Менеджер;
		Иначе
			Элементы.ЗакрепленныйМенеджер.ПодсказкаВвода = НСТР("ru = 'Менеджер не закреплен'; en = 'Manager not assigned'");  
		КонецЕсли;
	КонецЕсли;		
КонецПроцедуры
 


//rarus ozhnik 14927 17.02.2020 -
////////////////////////////////////////////////////////////////////////////////																									
// ОБРАБОТЧИКИ СЛУЖЕБНОГО ПРОГРАММНОГО ИНТЕРФЕЙСА																									
																									
																									
////////////////////////////////////////////////////////////////////////////////																									
// ОБРАБОТЧИКИ КОМАНД ФОРМЫ																									
																									

//rarus tenkam 18.12.2016 mantis 6897 ++
&НаСервере
Процедура ОбновитьЭлементНаСервере()
	Если НЕ ЗначениеЗаполнено(Объект.IDExternalSystem) Тогда
		//Создан вручную
	Иначе
		//rarus bonmak 16452 23.09.2020 ++
		//ИмяМетода = "GetOrderToDelivery";
		//СообщениеОбОшибке = "";
		//Отказ = Ложь;
		СтруктураПараметров = Scan_ВебСервисы.ПолучитьСтруктуруПараметровМетода(,Ложь);
		СтруктураПараметров.Вставить("GUID", Объект.IDExternalSystem);
		//ИмяСобытияЖурналаРегистрации = "Веб-сервис." + ИмяМетода;
		//ТекЭлементОтвет = Scan_ВебСервисы.ВызватьМетод(ИмяМетода, СтруктураПараметров, Отказ, ИмяСобытияЖурналаРегистрации);
		//Если НЕ Отказ Тогда
			//СсылкаПродукта = Scan_ВебСервисыРазборОтветов.РазборОтветаСправочникЗаказыНаЗавод(ТекЭлементОтвет,Отказ,СообщениеОбОшибке,ИмяСобытияЖурналаРегистрации,ИмяМетода);
		//КонецЕсли;
		СсылкаПродукта = Scan_ВебСервисыРазборОтветов.ВызватьМетод_GetOrderToDelivery(СтруктураПараметров, Ложь, "");
		//rarus bonmak 16452 23.09.2020 --
		ЭтаФорма.Прочитать();
		// rarus tenkam 25.04.2019 mantis 14327 +++
		MarketChange = Справочники.Scan_ЗаказыНаЗавод.ЧтениеЗначенияРегистраСведения(Объект.Ссылка, Перечисления.Scan_ДополнительнаяИнформацияПоЗаказамНаЗавод.MarketChange);
		Клиент = Справочники.Scan_ЗаказыНаЗавод.ЧтениеЗначенияРегистраСведения(Объект.Ссылка, Перечисления.Scan_ДополнительнаяИнформацияПоЗаказамНаЗавод.Клиент);
		// rarus tenkam 25.04.2019 mantis 14327 ---	
		// rarus tenkam 13.05.2019 mantis 14226 +++
		ТипЗаказа = Справочники.Scan_ЗаказыНаЗавод.ЧтениеЗначенияРегистраСведения(Объект.Ссылка, Перечисления.Scan_ДополнительнаяИнформацияПоЗаказамНаЗавод.ТипЗаказаНаЗавод); 
		//СтатусЗаказа = Справочники.Scan_ЗаказыНаЗавод.ЧтениеЗначенияРегистраСведения(Объект.Ссылка, Перечисления.Scan_ДополнительнаяИнформацияПоЗаказамНаЗавод.СтатусЗаказа); //rarus bonmak 15.08.2019 14576 
		// rarus tenkam 13.05.2019 mantis 14226 ---		
		// rarus tenkam 23.05.2019 mantis 14312 +++
		PartPeriod = Справочники.Scan_ЗаказыНаЗавод.ЧтениеЗначенияРегистраСведения(Объект.Ссылка, Перечисления.Scan_ДополнительнаяИнформацияПоЗаказамНаЗавод.PartPeriod); 
		// rarus tenkam 23.05.2019 mantis 14312 ---
		КомплектностьПоставки = Справочники.Scan_ЗаказыНаЗавод.ЧтениеЗначенияРегистраСведения(Объект.Ссылка, Перечисления.Scan_ДополнительнаяИнформацияПоЗаказамНаЗавод.КомплектностьПоставки); //rarus bonmak 04.07.2019 14301
		
		// rarus tenkam 24.05.2019 mantis 14224 +++
		ОбновитьКлючевыеДаты();
		// rarus tenkam 24.05.2019 mantis 14224 ---
		
		//rarus BProg_Dekin 11.02.2020 mantis 0014560 +- Заполнение SOrder и FFU  
		SOrder 	= РегистрыСведений.Scan_КвотыSOrderFFUФакт.ПолучитьОпцию(Объект.Ссылка, Справочники.Scan_ТипыОпций.SOrderОпции); 
		FFU 	= РегистрыСведений.Scan_КвотыSOrderFFUФакт.ПолучитьОпцию(Объект.Ссылка, Справочники.Scan_ТипыОпций.FFUОпции);
		//rarus BProg_Dekin 11.02.2020 mantis 0014560 --

		УправлениеДиалогомНаСервере();
	КонецЕсли
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьЭлемент(Команда)
	ОбновитьЭлементНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура Избранное(Команда)
	//rarus BProg_Dekin 29.10.2019 0014452 ++ открытие формы НастройкиОтображенияКлючевыхДат
	ОписаниеОповещения = Новый ОписаниеОповещения("ПослеНастройкиКлючевыхДатПоПользователям", ЭтаФорма);
	ОткрытьФорму("РегистрСведений.Scan_НастройкиКлючевыхДатПоПользователям.Форма.НастройкиОтображенияКлючевыхДат", , ЭтаФорма,,,, ОписаниеОповещения, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	//rarus BProg_Dekin 29.10.2019 0014452 --
КонецПроцедуры

&НаКлиенте
Процедура ПослеНастройкиКлючевыхДатПоПользователям(Результат, ДополнительнеПараметры) Экспорт //rarus BProg_Dekin 29.10.2019 0014452 +-
	Если Результат = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если Результат.ПеречитатьСписокКлючевыхДат Тогда
		ОтобразитьКолонкиКлючевыхДат();		
	КонецЕсли;
КонецПроцедуры

//rarus tenkam 18.12.2016 mantis 6897 --
																									
																									
////////////////////////////////////////////////////////////////////////////////																									
// ОБРАБОТЧИКИ СОБЫТИЙ ЭЛЕМЕНТОВ ФОРМЫ																									

//&НаКлиенте
//Процедура ПродуктГотовПриИзменении(Элемент)
//	ПродуктГотовПриИзмененииНаСервере();
//КонецПроцедуры

//&НаСервере
//Процедура ПродуктГотовПриИзмененииНаСервере()
//	Справочники.Scan_ЗаказыНаЗавод.ФлагПродуктГотовПриИзменении(Объект);
//	УправлениеДиалогомНаСервере();
//КонецПроцедуры
//rarus BProg_Dekin 29.10.2019 0014452 --

&НаКлиенте
Процедура ЕстьБукингЛистПриИзменении(Элемент)
	ЕстьБукингЛистПриИзмененииНаСервере();
КонецПроцедуры

&НаСервере
Процедура ЕстьБукингЛистПриИзмененииНаСервере()
	Справочники.Scan_ЗаказыНаЗавод.ФлагЕстьБукингЛистПриИзменении(Объект);
	УправлениеДиалогомНаСервере();
КонецПроцедуры

//rarus BProg_Gladkov 12.12.2019 0014452 ++ Ручное редактирование CCD не поддкрживается.
//&НаКлиенте
//Процедура CDDПриИзменении(Элемент)
//	CDDПриИзмененииНаСервере();
//КонецПроцедуры

//&НаСервере
//Процедура CDDПриИзмененииНаСервере()
//	КлючевыеДаты[0].CDDX = Справочники.Scan_ЗаказыНаЗавод.РассчитатьCDDX(КлючевыеДаты[0].CDD, КлючевыеДаты[0].CDD2, Объект.НапоминаниеДилерамОтправлено); 
//	//Справочники.Scan_ЗаказыНаЗавод.УстановитьCDDX(Объект, КлючевыеДаты[0]);
//	
//	//Справочники.Scan_ЗаказыНаЗавод.УстановитьНапоминаниеАдмПродажОтправлено(Объект);		//rarus tenkam 18.01.2017 mantis 7185 +
//КонецПроцедуры
//rarus BProg_Gladkov 12.12.2019 0014452 --

// rarus tenkam 24.04.2019 mantis 14223 +++
&НаКлиенте
Процедура ТекЗаводскойСтатусЗаказаОткрытие(Элемент, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	ПоказатьЗначение(,Объект.ЗаводскойСтатусЗаказа);
КонецПроцедуры
// rarus tenkam 24.04.2019 mantis 14223 ---

// rarus tenkam 25.04.2019 mantis 14327 +++	
&НаКлиенте
Процедура КлиентПриИзменении(Элемент)
	Модифицированность = Истина;
КонецПроцедуры
// rarus tenkam 25.04.2019 mantis 14327 ---

// rarus tenkam 13.05.2019 mantis 14226 +++ 
&НаКлиенте
Процедура ТипЗаказаПриИзменении(Элемент)
	УправлениеДиалогомНаСервере();
КонецПроцедуры
// rarus tenkam 13.05.2019 mantis 14226 ---

// rarus tenkam 24.05.2019 mantis 14224 +++
&НаКлиенте
Процедура КлючевыеДатыЗначениеПриИзменении(Элемент)
	Модифицированность = Истина;
	ТекущиеДанные = Элементы.КлючевыеДаты.ТекущиеДанные;
		
	// rarus tenkam 06.11.2020 mantis 16673 +++			
	//Если ТекущиеДанные.ВидКлючевойДаты = ПредопределенноеЗначение("Перечисление.Scan_КлючевыеДаты.RFD") Тогда
	//	ЗначениеRFD = ТекущиеДанные.Значение;
	//	// При изменении RFD нужно переситать LDD = RFD + настройка 300014
	//	ПараметрыОтбора = Новый Структура("ВидКлючевойДаты", ПредопределенноеЗначение("Перечисление.Scan_КлючевыеДаты.LDD"));
	//	МассивСтрок = КлючевыеДаты.НайтиСтроки(ПараметрыОтбора);
	//	Если МассивСтрок.Количество() <> 0 Тогда
	//		НайденнаяСтрока = МассивСтрок[0];
	//		Если НЕ ЗначениеЗаполнено(ЗначениеRFD) Тогда
	//	    	НайденнаяСтрока.Значение = Дата(1,1,1);
	//		Иначе
	//			НайденнаяСтрока.Значение = ЗначениеRFD + ПолучитьНастройкуДляLDD()*24*60*60;
	//		КонецЕсли;
	//	КонецЕсли;
	//	
	//ИначеЕсли Истина Тогда
	//	
	//КонецЕсли;
	// rarus tenkam 06.11.2020 mantis 16673 ---			
	
КонецПроцедуры       
// rarus tenkam 24.05.2019 mantis 14224 ---
// rarus tenkam 18.09.2019 mantis 14576 ---


&НаКлиенте
Процедура ПроизводствоКлючевыеДатыПриИзменении(Элемент)
	ПриИзменииКлючевыхДат();
КонецПроцедуры

&НаКлиенте
Процедура НадстройкаКлючевыеДатыПриИзменении(Элемент)
	ПриИзменииКлючевыхДат();
КонецПроцедуры

&НаКлиенте
Процедура ЛогистикаКлючевыеДатыПриИзменении(Элемент)
	ПриИзменииКлючевыхДат();
КонецПроцедуры

&НаКлиенте
Процедура ОтгрузкаКлючевыеДатыПриИзменении(Элемент)
	ПриИзменииКлючевыхДат();
КонецПроцедуры

&НаКлиенте
Процедура КлючевыеДатыПриИзменении(Элемент)
	ПриИзменииКлючевыхДат();
КонецПроцедуры

&НаКлиенте
Процедура ПриИзменииКлючевыхДат() //rarus BProg_Dekin 14.11.2019 0014452 +-
	Модифицированность = Истина;
КонецПроцедуры

&НаКлиенте
Процедура ГотовностьТСПриИзменении(Элемент) 
	ГотовностьТСПриИзмененииНаСервере(); //rarus BProg_Dekin 13.03.2020 0015725 +-	
КонецПроцедуры

Функция  ГотовностьТСПриИзмененииНаСервере() //rarus BProg_Dekin 13.03.2020 0015725 +-
	Если Объект.ГотовностьТС Тогда
		КлючевыеДаты[0].RFT = ТекущаяДатаСеанса();
	Иначе
		КлючевыеДаты[0].RFT = Дата(1,1,1);
	КонецЕсли;
КонецФункции
////////////////////////////////////////////////////////////////////////////////																									
// ОБРАБОТЧИКИ ОСНОВНЫХ СОБЫТИЙ ФОРМЫ																									

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	
	ОбновитьКолонкиЗаказовНаЗакупку();//rarus vikhle 12.02.2021 mt 17197
	
КонецПроцедуры

// Обработчик события возникающего на сервере при создании формы.
//																									
// Параметры:																									
//  Отказ                - Булево - Признак отказа от создания формы.																									
//  СтандартнаяОбработка - Булево - В данный параметр передается признак выполнения системной обработки события.																									
//																									
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	// СтандартныеПодсистемы.ВерсионированиеОбъектов
	ВерсионированиеОбъектов.ПриСозданииНаСервере(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.ВерсионированиеОбъектов
	
	// rarus tenkam 21.05.2019 mantis 14226 +++
	// Обновление диалога перенесено после получения данных реквизитов формы
	//УправлениеДиалогомНаСервере();
	//НастроитьОтборыДинамическихСписков();
	// rarus tenkam 21.05.2019 mantis 14226 ---
	
	// rarus tenkam 25.09.2019 mantis 14979 +++	
	Если НЕ ЗначениеЗаполнено(Объект.Ссылка) И НЕ ЗначениеЗаполнено(Объект.IDExternalSystem) Тогда
		// Это новый объект не из 1БД
		Объект.СозданВручную = Истина;
	КонецЕсли;
	// rarus tenkam 25.09.2019 mantis 14979 ---	
	
	// rarus tenkam 25.04.2019 mantis 14327 +++
	Если ЗначениеЗаполнено(Объект.Ссылка) Тогда
		MarketChange = Справочники.Scan_ЗаказыНаЗавод.ЧтениеЗначенияРегистраСведения(Объект.Ссылка, Перечисления.Scan_ДополнительнаяИнформацияПоЗаказамНаЗавод.MarketChange);
		Клиент = Справочники.Scan_ЗаказыНаЗавод.ЧтениеЗначенияРегистраСведения(Объект.Ссылка, Перечисления.Scan_ДополнительнаяИнформацияПоЗаказамНаЗавод.Клиент);
		// rarus tenkam 13.05.2019 mantis 14226 +++
		ТипЗаказа = Справочники.Scan_ЗаказыНаЗавод.ЧтениеЗначенияРегистраСведения(Объект.Ссылка, Перечисления.Scan_ДополнительнаяИнформацияПоЗаказамНаЗавод.ТипЗаказаНаЗавод); 
		//СтатусЗаказа = Справочники.Scan_ЗаказыНаЗавод.ЧтениеЗначенияРегистраСведения(Объект.Ссылка, Перечисления.Scan_ДополнительнаяИнформацияПоЗаказамНаЗавод.СтатусЗаказа); //rarus bonmak 15.08.2019 14576 
		// rarus tenkam 13.05.2019 mantis 14226 ---
		// rarus tenkam 13.05.2019 mantis 14312 +++
		PartPeriod = Справочники.Scan_ЗаказыНаЗавод.ЧтениеЗначенияРегистраСведения(Объект.Ссылка, Перечисления.Scan_ДополнительнаяИнформацияПоЗаказамНаЗавод.PartPeriod);
		// rarus tenkam 13.05.2019 mantis 14312 ---
		КомплектностьПоставки = Справочники.Scan_ЗаказыНаЗавод.ЧтениеЗначенияРегистраСведения(Объект.Ссылка, Перечисления.Scan_ДополнительнаяИнформацияПоЗаказамНаЗавод.КомплектностьПоставки); //rarus bonmak 04.07.2019 14301
		
		Изделие = РегистрыСведений.Scan_ВзаимосвязьИзделийИЗаказов.ПолучитьИзделиеПоЗаказу(Объект.Ссылка); //rarus BProg_Dekin 31.10.2019 0014452 +- заполнение изделия
		ЗамечанияПоИзделию.Параметры.УстановитьЗначениеПараметра("Изделие", Изделие); //rarus BProg_Gladkov 03.12.2019 0014452 +- Заполнить замечания по изделию
		
		//rarus vikhle 07.09.2020 mt 16181 +++
		Если НЕ Изделие.Пустая() Тогда
			//СоглашениеОПоставке = РегистрыСведений.Scan_СоставСоглашенийОПоставке.ПолучитьСоглашениеОПоставке(Изделие);
			СоглашениеОПоставке = Изделие.СоглашениеОПоставке;//rarus vikhle 18.12.2020 mt 16955
			Если НЕ СоглашениеОПоставке.Пустая() Тогда
				СтрокаТЧСоглашения = СоглашениеОПоставке.СписокПродуктов.Найти(Изделие,"Продукт");
				Если НЕ СтрокаТЧСоглашения = Неопределено Тогда
					Драйв = СтрокаТЧСоглашения.ПроцентДрайв <> 0;
					СУ    = СтрокаТЧСоглашения.СпециальныеУсловия;
				КонецЕсли;	
			КонецЕсли;
		КонецЕсли;
		//rarus vikhle 07.09.2020 mt 16181 ---
		
		//rarus ozhnik 14927 17.02.2020 + 
		ВывестиОтветственногоМенеджера();
		//rarus ozhnik 14927 17.02.2020 -
	КонецЕсли;
	// rarus tenkam 25.04.2019 mantis 14327 ---	
	
	// rarus tenkam 21.05.2019 mantis 14226 +++
	УправлениеДиалогомНаСервере();
	НастроитьОтборыДинамическихСписков();
	// rarus tenkam 21.05.2019 mantis 14226 ---
	
	// rarus tenkam 24.05.2019 mantis 14224 +++
	ОбновитьКлючевыеДаты();
	// rarus tenkam 24.05.2019 mantis 14224 ---
	 
	//rarus BProg_Dekin 11.02.2020 mantis 0014560 +- Заполнение SOrder и FFU  
	SOrder 	= РегистрыСведений.Scan_КвотыSOrderFFUФакт.ПолучитьОпцию(Объект.Ссылка, Справочники.Scan_ТипыОпций.SOrderОпции); 
	FFU 	= РегистрыСведений.Scan_КвотыSOrderFFUФакт.ПолучитьОпцию(Объект.Ссылка, Справочники.Scan_ТипыОпций.FFUОпции);
	//rarus BProg_Dekin 11.02.2020 mantis 0014560 --
	
	ЛичныйКомментарий = РегистрыСведений.Scan_ЛичныеКомментарииПользователей.ПолучитьКомментарий(ПараметрыСеанса.ТекущийПользователь, Объект.Ссылка);  //rarus BProg_Dekin 04.03.2020 mantis 0015725 +-
	
	// rarus tenkam 21.08.2020 mantis 16422 +++	
	Если ЗначениеЗаполнено(Изделие) И ЗначениеЗаполнено(Изделие.ТипПродукта) И ЗначениеЗаполнено(Изделие.МодельПродукта) И 
			Изделие.ТипПродукта.ВидПродукта = Scan_ПраваИНастройки.Scan_Право("ВидПродуктаГрузовыеАвтомобили") Тогда
		ТягачШасси = Изделие.МодельПродукта.ТягачШасси;
	Иначе
		ТягачШасси = ПредопределенноеЗначение("Перечисление.Scan_ПризнакТягачШасси.ПустаяСсылка");
	КонецЕсли;
	// rarus tenkam 21.08.2020 mantis 16422 ---
	
	//rarus agar 12.05.2021 17753 ++
	СтарыйКомментарий = Объект.Комментарий;
	//rarus agar 12.05.2021 17753 --
	Scan_СборСтатистики.Scan_ПриОткрытии("Справочники", РеквизитФормыВЗначение("Объект").Метаданные().Синоним);	

КонецПроцедуры

//rarus vikhle 28.04.2020 mt 15695 +++
&НаКлиенте
Процедура ПриОткрытии(Отказ)
	Scan_ВспомогательныеФункцииКлиент.ПроверитьПользователяПортала();
КонецПроцедуры
//rarus vikhle 28.04.2020 mt 15695 ---

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	// rarus tenkam 25.09.2019 mantis 14979 +++
	//Объект.СозданВручную = Истина;
	// rarus tenkam 25.09.2019 mantis 14979 ---
	
	НайденнаяКЗ = Справочники.Scan_ЗаказыНаЗавод.НайтиПоНаименованию(СокрЛП(Объект.Наименование),Истина);
	Если НЕ (НайденнаяКЗ = Справочники.Scan_ЗаказыНаЗавод.ПустаяСсылка()) Тогда
		//нашли с таким же наименованием
		Если НайденнаяКЗ <> Объект.Ссылка Тогда
			Отказ = Истина;
			//rarus FominskiyAS 08.07.2019  mantis 14191 +++
			//Сообщить("Карточка заказа с таким наименованием уже есть!");
			Сообщить(НСтр("ru = 'Карточка заказа с таким наименованием уже есть!'; en = 'Order card with the same name already exists'"));
			//rarus FominskiyAS 08.07.2019  mantis 14191 ---  
		КонецЕсли;
	КонецЕсли;
	
	//rarus BProg_Dekin 19.05.2020 mantis 0015999 ++ Поле СтатусЗаказаЛокальный больше не используется 
	////rarus bonmak 15.08.2019 14576 ++
	//Если Объект.ЗаводскойСтатусЗаказа.СтатусCOW = 45 И ТипЗаказа <> Перечисления.Scan_ТипыЗаказовНаЗавод.OpenOrder 
	//	И ТипЗаказа <> Перечисления.Scan_ТипыЗаказовНаЗавод.ПустаяСсылка() И Объект.СтатусЗаказаЛокальный <> Справочники.Scan_ЛокальныеСтатусыЗаказовНаЗавод.Deleted Тогда
	//	Объект.СтатусЗаказаЛокальный = Справочники.Scan_ЛокальныеСтатусыЗаказовНаЗавод.Deleted;
	//КонецЕсли;
	//rarus BProg_Dekin 19.05.2020 mantis 0015999 ++
	
	// rarus tenkam 13.04.2020 mantis 15958 +++
	//Если Объект.ЗаводскойСтатусЗаказа.СтатусCOW = 15 И Объект.СтатусЗаказаЛокальный = Справочники.Scan_ЛокальныеСтатусыЗаказовНаЗавод.ПустаяСсылка() Тогда
	//	Объект.СтатусЗаказаЛокальный = Справочники.Scan_ЛокальныеСтатусыЗаказовНаЗавод.NEW;
	//КонецЕсли;
	// rarus tenkam 13.04.2020 mantis 15958 ---
	//rarus bonmak 15.08.2019 14576 --
	
	
	//rarus BProg_Gladkov 20.11.2019 0014452 ++ Запись ключевых дат перемещена из "ПослеЗаписи" в "ПриЗаписи"
		//УстановленаДатаПродажи = Ложь;	// rarus tenkam 13.08.2019 mantis 14427 +
		//Для Каждого ТекСтрока Из КлючевыеДаты Цикл
		//	 rarus tenkam 13.08.2019 mantis 14427 +++
		//	//РегистрыСведений.Scan_КлючевыеДатыПроцессов.ЗаписьЗначенияРегистраСведения(Объект.Ссылка, Перечисления.Scan_ОбъектыКлючевыхДат.ЗаказНаЗавод, ТекСтрока.Значение, ТекСтрока.ВидКлючевойДаты);	
		//	Если ТекСтрока.ВидКлючевойДаты = ПредопределенноеЗначение("Перечисление.Scan_КлючевыеДаты.ДатаПередачиИзделияДилеру") И УстановленаДатаПродажи Тогда
		//		Продолжить;
		//	КонецЕсли;
		//	РегистрыСведений.Scan_КлючевыеДатыПроцессов.ЗаписьЗначенияРегистраСведения(Объект.Ссылка, Перечисления.Scan_ОбъектыКлючевыхДат.ЗаказНаЗавод, ТекСтрока.Значение, ТекСтрока.ВидКлючевойДаты, , УстановленаДатаПродажи);	
		//КонецЦикла;
	
	КлючевыеДатыОбъекта = РегистрыСведений.Scan_КлючевыеДатыПроцессов.КлючевыеДатыОбъекта(Объект.Ссылка);
	ЗаполнитьЗначенияСвойств(КлючевыеДатыОбъекта, КлючевыеДаты[0]);
	
	Если ЗначениеЗаполнено(КлючевыеДатыОбъекта.ДатаПродажиИзделия) тогда 
		ТекущеЗначение_ДатаПродажиИзделия = РегистрыСведений.Scan_КлючевыеДатыПроцессов.КлючеваяДата(Объект.Ссылка, "ДатаПродажиИзделия");
		УстановленаДатаПродажи = НЕ ЗначениеЗаполнено(ТекущеЗначение_ДатаПродажиИзделия);
		Если УстановленаДатаПродажи тогда
			//rarus bonmak 24.12.2019 15553 ++
			//было
			//КлючевыеДатыОбъекта.Удалить("ДатаПередачиИзделияДилеру");
			ТекущеЗначение_ДатаПередачиИзделияДилеру = РегистрыСведений.Scan_КлючевыеДатыПроцессов.КлючеваяДата(Объект.Ссылка, "ДатаПередачиИзделияДилеру");
			КлючевыеДатыОбъекта.ДатаПередачиИзделияДилеру = ТекущеЗначение_ДатаПередачиИзделияДилеру;
			//rarus bonmak 24.12.2019 15553 --
		КонецЕсли;
	КонецЕсли;
	
	//rarus BProg_Dekin 19.05.2020 mantis 0015999 ++
	//// rarus tenkam 13.04.2020 mantis 15958 +++
	//Если НЕ ЗначениеЗаполнено(КлючевыеДатыОбъекта.ДатаПродажиИзделия) И 
	//	Объект.СтатусЗаказаЛокальный = Справочники.Scan_ЛокальныеСтатусыЗаказовНаЗавод.ПустаяСсылка() Тогда
	//	Объект.СтатусЗаказаЛокальный = Справочники.Scan_ЛокальныеСтатусыЗаказовНаЗавод.NEW;
	//КонецЕсли;
	//// rarus tenkam 13.04.2020 mantis 15958 ---
	//rarus BProg_Dekin 19.05.2020 mantis 0015999 --
	
	ТекущийОбъект.ДополнительныеСвойства.Вставить("КлючевыеДатыОбъекта", КлючевыеДатыОбъекта);
	//rarus BProg_Gladkov 20.11.2019 0014452 -- 
	
	//rarus agar 12.05.2021 17753 ++
	Если Не ПустаяСтрока(ТекущийОбъект.Комментарий)
		И   СокрЛП(ТекущийОбъект.Комментарий) <> СокрЛП(СтарыйКомментарий) 
		Тогда
		ТекущийОбъект.Комментарий = ТекущийОбъект.Комментарий + " ("+СокрЛП(Пользователи.АвторизованныйПользователь())+")";
		СтарыйКомментарий = ТекущийОбъект.Комментарий;
	КонецЕсли;
	//rarus agar 12.05.2021 17753 --
	
	// Rarus tenkam 11.04.2022 mantis 18433 +++
	Если Объект.Ссылка.Пустая() Тогда
		Scan_СборСтатистики.Scan_ПередЗаписьюСправочника(РеквизитФормыВЗначение("Объект").Метаданные().Синоним, Истина, "Создание нового элемента");
	КонецЕсли;
	// Rarus tenkam 11.04.2022 mantis 18433 --- 

КонецПроцедуры

&НаСервере
Процедура ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи)
	
	//Справочники.Scan_ЗаказыНаЗавод.ЗаписатьЛогКонтрольныхТочек(Объект);	//rarus tenkam 04.10.2016 mantis 7183 + перенесла в модуль объекта
	НастроитьОтборыДинамическихСписков();
	
	////rarus sergei 06.07.2016 mantis 6929 ++
	//ЗаписатьВзаимосвязьПродуктовИКарточекВРегистр();
	////rarus sergei 06.07.2016 mantis 6929 --
	//
	////rarus sergei 08.07.2016 mantis 7111 ++
	//Если ЗначениеЗаполнено(Объект.Продукт) Тогда
	//	
	//	НаДату = ТекущаяДата();
	//	Справочники.Scan_Изделия.ЗаписьЗначенияРегистраСведения(Объект.Продукт, Объект.НомерСОП,Перечисления.Scan_ДополнительнаяИнформацияПоПродуктам.СОП, НаДату);
	//	Справочники.Scan_Изделия.ЗаписьЗначенияРегистраСведения(Объект.Продукт, Объект.ДатаСОП,Перечисления.Scan_ДополнительнаяИнформацияПоПродуктам.ДатаСОП, НаДату);
	//	//Справочники.Scan_Изделия.ЗаписьЗначенияРегистраСведения(Объект.Продукт, Объект.Продавец,Перечисления.Scan_ДополнительнаяИнформацияПоПродуктам.ПродавецДилера, НаДату);
	//КонецЕсли; 	
	////rarus sergei 08.07.2016 mantis 7111 --
	
	// rarus tenkam 25.04.2019 mantis 14327 +++
	НаДату = ТекущаяДата();
	Справочники.Scan_ЗаказыНаЗавод.ЗаписьЗначенияРегистраСведения(Объект.Ссылка, MarketChange, Перечисления.Scan_ДополнительнаяИнформацияПоЗаказамНаЗавод.MarketChange, НаДату);
	Справочники.Scan_ЗаказыНаЗавод.ЗаписьЗначенияРегистраСведения(Объект.Ссылка, Клиент, Перечисления.Scan_ДополнительнаяИнформацияПоЗаказамНаЗавод.Клиент, НаДату);
	// rarus tenkam 25.04.2019 mantis 14327 ---
	Справочники.Scan_ЗаказыНаЗавод.ЗаписьЗначенияРегистраСведения(Объект.Ссылка, КомплектностьПоставки, Перечисления.Scan_ДополнительнаяИнформацияПоЗаказамНаЗавод.КомплектностьПоставки, НаДату); //rarus bonmak 04.07.2019 14301
	// rarus tenkam 13.05.2019 mantis 14226 +++
	Справочники.Scan_ЗаказыНаЗавод.ЗаписьЗначенияРегистраСведения(Объект.Ссылка, ТипЗаказа, Перечисления.Scan_ДополнительнаяИнформацияПоЗаказамНаЗавод.ТипЗаказаНаЗавод, НаДату);
	//rarus bonmak 15.08.2019 14576 ++
	//Если (ТипЗаказа = Перечисления.Scan_ТипыЗаказовНаЗавод.AOrder ИЛИ ТипЗаказа = Перечисления.Scan_ТипыЗаказовНаЗавод.OpenOrder) Тогда
	//	Справочники.Scan_ЗаказыНаЗавод.ЗаписьЗначенияРегистраСведения(Объект.Ссылка, СтатусЗаказа, Перечисления.Scan_ДополнительнаяИнформацияПоЗаказамНаЗавод.СтатусЗаказа, НаДату);
	//КонецЕсли;
	//rarus bonmak 15.08.2019 14576 --
	// rarus tenkam 13.05.2019 mantis 14226 ---
	// rarus tenkam 13.05.2019 mantis 14312 +++
	Справочники.Scan_ЗаказыНаЗавод.ЗаписьЗначенияРегистраСведения(Объект.Ссылка, ?(СокрЛП(PartPeriod) = "", 0, Число(СокрЛП(СтрЗаменить(PartPeriod," ","")))), Перечисления.Scan_ДополнительнаяИнформацияПоЗаказамНаЗавод.PartPeriod, НаДату);
	// rarus tenkam 13.05.2019 mantis 14312 --- 	
	
	//rarus ozhnik 14927 17.02.2020 + 
	Если Объект.Заказчик = Справочники.Scan_Контрагенты.СканияРусь и ЗначениеЗаполнено(ЗакрепленныйМенеджер) Тогда
			//Нужно проверить что данный менеджер установлен как ответственный за заказ на завод
			НужноЗаписатьМенеджера = истина;
			Запрос = Новый Запрос;
			Запрос.Текст = 
				"ВЫБРАТЬ
				|	Scan_ЗакреплениеМенеджеровЗаЗаказамиНаЗаводСрезПоследних.Менеджер КАК Менеджер
				|ИЗ
				|	РегистрСведений.Scan_ЗакреплениеМенеджеровЗаЗаказамиНаЗавод.СрезПоследних(, ЗаказНаЗавод = &Ссылка) КАК Scan_ЗакреплениеМенеджеровЗаЗаказамиНаЗаводСрезПоследних";
			
			Запрос.УстановитьПараметр("Ссылка", Объект.Ссылка);
			
			РезультатЗапроса = Запрос.Выполнить();
			
			ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
			
			Если ВыборкаДетальныеЗаписи.Следующий() Тогда
				Если ВыборкаДетальныеЗаписи.Менеджер = ЗакрепленныйМенеджер Тогда
					НужноЗаписатьМенеджера = ложь;	
				КонецЕсли;
			Иначе
				// Закрепленного менеджера нет, и текущий менеджер "Скания Русь", закрепеление не нужно
				Если ЗакрепленныйМенеджер.МенеджерСканияРусь Тогда
					НужноЗаписатьМенеджера = ложь;		
				КонецЕсли;
			КонецЕсли;
			Если НужноЗаписатьМенеджера Тогда
				ЗаписьРегСведений = РегистрыСведений.Scan_ЗакреплениеМенеджеровЗаЗаказамиНаЗавод.СоздатьМенеджерЗаписи();
				ЗаписьРегСведений.ЗаказНаЗавод	  	= Объект.Ссылка;
				ЗаписьРегСведений.Менеджер 			= ЗакрепленныйМенеджер;
				ЗаписьРегСведений.Период      		= ТекущаяДатаСеанса();
				ЗаписьРегСведений.Пользователь 		= ПользователиКлиентСервер.ТекущийПользователь();
				
				Попытка
					ЗаписьРегСведений.Записать();
				Исключение
					ВывестиСообщениеПол(НСтр("ru = 'Ошибка закрепления менеджера за заказом'; en = 'Error assigning manager to order'"));  				              				
				КонецПопытки; 

			КонецЕсли; 
		КонецЕсли; 
		
	
	//rarus ozhnik 14927 17.02.2020 -
	ОбновитьКлючевыеДаты();	// rarus tenkam 13.08.2019 mantis 14427 +
	
	//rarus BProg_Dekin 04.03.2020 mantis 0015725 ++
	Если ЗначениеЗаполнено(ЛичныйКомментарий) Тогда
		РегистрыСведений.Scan_ЛичныеКомментарииПользователей.ЗаписьЗначенияРегистраСведения(ПараметрыСеанса.ТекущийПользователь, Объект.Ссылка, ЛичныйКомментарий);
	КонецЕсли;
	//rarus BProg_Dekin 04.03.2020 mantis 0015725 --
КонецПроцедуры

//rarus sergei 25.08.2016 mantis 7163 ++ 
&НаСервере
Процедура ПриЗаписиНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	// rarus tenkam 05.04.2019 mantis 14316 +++
	//ПрисоединенныеФайлы.ПриЗаписиНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи, Параметры);
	РаботаСФайлами.ПриЗаписиНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи, Параметры);
	// rarus tenkam 05.04.2019 mantis 14316 ---
	
	//rarus BProg_Dekin 13.02.2020 mantis 0014560 ++ Не надо записывать SOrder и FFU в регистр, так как они уже там
	////rarus BProg_Gladkov 28.11.2019 0014560 ++ Сохранить SOrder и FFU в регистр Scan_КвотыSOrderFFUФакт
	//МенеджерЗаписи = РегистрыСведений.Scan_КвотыSOrderFFUФакт.СоздатьМенеджерЗаписи();
	//МенеджерЗаписи.ЗаказНаЗавод 	= ТекущийОбъект.Ссылка;
	//МенеджерЗаписи.ТипОпции 		= Справочники.Scan_ТипыОпций.SOrderОпции;
	//Если ЗначениеЗаполнено(SOrder) Тогда
	//	МенеджерЗаписи.Опция 		= SOrder;
	//	МенеджерЗаписи.Записать();
	//Иначе 
	//	МенеджерЗаписи.Удалить();
	//КонецЕсли;
	//
	//МенеджерЗаписи = РегистрыСведений.Scan_КвотыSOrderFFUФакт.СоздатьМенеджерЗаписи();
	//МенеджерЗаписи.ЗаказНаЗавод 	= ТекущийОбъект.Ссылка;
	//МенеджерЗаписи.ТипОпции 		= Справочники.Scan_ТипыОпций.FFUОпции;
	//Если ЗначениеЗаполнено(FFU) Тогда
	//	МенеджерЗаписи.Опция 		= FFU;
	//	МенеджерЗаписи.Записать();
	//Иначе 
	//	МенеджерЗаписи.Удалить();
	//КонецЕсли;
	////rarus BProg_Gladkov 28.11.2019 0014560 --
	//rarus BProg_Dekin 13.02.2020 mantis 0014560 ++
КонецПроцедуры

&НаКлиенте
Процедура КомплектностьПоставкиПриИзменении(Элемент) //rarus bonmak 04.07.2019 14301 ++
	Модифицированность = Истина;
КонецПроцедуры //rarus bonmak 04.07.2019 14301 --

&НаСервере
Процедура ОграничитьДоступностьИзмененияКлючевойДаты(ИмяЭлементаТабличнойЧасти) //rarus BProg_Dekin 01.11.2019 0014452 +- Ограничение доступности ключевых дат
	ДоступныеДляРедактированияКолонки = Новый Массив;
	//rarus BProg_Dekin 04.03.2020 mantis 0015725 ++
	//ДоступныеДляРедактированияКолонки.Добавить("КлючевыеДаты.PODOD");
	//ДоступныеДляРедактированияКолонки.Добавить("КлючевыеДаты.ADDLBB");
	//ДоступныеДляРедактированияКолонки.Добавить("КлючевыеДаты.AN"); 
	//ДоступныеДляРедактированияКолонки.Добавить("КлючевыеДаты.PAD");
	//ДоступныеДляРедактированияКолонки.Добавить("КлючевыеДаты.AAD");
	//ДоступныеДляРедактированияКолонки.Добавить("КлючевыеДаты.PTSD");
	//ДоступныеДляРедактированияКолонки.Добавить("КлючевыеДаты.RFT");
	//rarus BProg_Dekin 04.03.2020 mantis 0015725 --
	//rarus bonmak 09.08.2021 16834 ДоступныеДляРедактированияКолонки.Добавить("КлючевыеДаты.RFD");
	//rarus vikhle 20.10.2021 mt 18435 +++
	//ДоступныеДляРедактированияКолонки.Добавить("КлючевыеДаты.ДатаПродажиИзделия");
	//ДоступныеДляРедактированияКолонки.Добавить("КлючевыеДаты.ДатаПередачиИзделияДилеру");
	//ДоступныеДляРедактированияКолонки.Добавить("КлючевыеДаты.ПродуктВАрхиве");
	//rarus vikhle 20.10.2021 mt 18435 ---
	//ДоступныеДляРедактированияКолонки.Добавить("КлючевыеДаты.БроньДилера"); //rarus pechek 27.12.2019 mantis 15409 //rarus bonmak 29.03.2021 17400
	
	Если Scan_ПраваИНастройки.Scan_Право("РазрешатьИзменениеДатыОтгрузкиСЗаводаПриEXW") Тогда
		ДоступныеДляРедактированияКолонки.Добавить("КлючевыеДаты.ДатаОтгрузкиСЗаводаПриEXW");
	КонецЕсли;
	
	Если Scan_ПраваИНастройки.Scan_Право("РазрешатьРедактироватьEDDиRDB") Тогда // rarus vikhle 18.02.2020 mt 14870
		ДоступныеДляРедактированияКолонки.Добавить("КлючевыеДаты.EDD"); 
		ДоступныеДляРедактированияКолонки.Добавить("КлючевыеДаты.RDB"); // rarus vikhle 18.02.2020 mt 14870
	КонецЕсли;
	
	//rarus BProg_Dekin 04.03.2020 mantis 0015725 ++
	Если Scan_ПраваИНастройки.Scan_Право("РазрешатьРедактироватьДатыПоНадстройкам") Тогда 
		ДоступныеДляРедактированияКолонки.Добавить("КлючевыеДаты.AN"); 
		ДоступныеДляРедактированияКолонки.Добавить("КлючевыеДаты.PAD");
		ДоступныеДляРедактированияКолонки.Добавить("КлючевыеДаты.AAD");
		ДоступныеДляРедактированияКолонки.Добавить("КлючевыеДаты.PTSD");
		ДоступныеДляРедактированияКолонки.Добавить("КлючевыеДаты.ADDLBB");
		ДоступныеДляРедактированияКолонки.Добавить("КлючевыеДаты.PODOD");
		ДоступныеДляРедактированияКолонки.Добавить("КлючевыеДаты.RFT");
	КонецЕсли;	
	//rarus BProg_Dekin 04.03.2020 mantis 0015725 --
	
	// rarus vikhle 08.12.2021 m 18500 +++
	Если Scan_ПраваИНастройки.Scan_Право("РазрешитьРедактироватьКвоту") Тогда 
		ДоступныеДляРедактированияКолонки.Добавить("КлючевыеДаты.Квота");
	КонецЕсли;	
	// rarus vikhle 08.12.2021 m 18500 ---
	
	Для Каждого Колонка Из Элементы[ИмяЭлементаТабличнойЧасти].ПодчиненныеЭлементы Цикл
		Если ТипЗнч(Колонка) = Тип("ПолеФормы") Тогда
			ТолькоПросмотрКолонки = (ДоступныеДляРедактированияКолонки.Найти(Колонка.ПутьКДанным) = Неопределено);
			ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, Колонка.Имя, "ТолькоПросмотр", ТолькоПросмотрКолонки);	
		КонецЕсли;
	КонецЦикла;		
КонецПроцедуры

&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи) //rarus bonmak 24.12.2019 15553 ++
	ЭтаФорма.Прочитать();
	Оповестить("ИзмененияКлючевыхДатВФорме",Истина); //rarus pechek 30.01.2020 mantis 15653
	ОбновитьОтображениеДанных(Элементы.ГотовностьТС);
КонецПроцедуры //rarus bonmak 24.12.2019 15553 --
//rarus sergei 25.08.2016 mantis 7163 --

//rarus ozhnik 14927 17.02.2020 + 
&НаКлиенте
Процедура ЗаказчикПриИзменении(Элемент)
	УправлениеДиалогомНаСервере();	
КонецПроцедуры
//rarus ozhnik 14927 17.02.2020 -

//rarus agar 27.08.2020 15696 ++
&НаКлиенте
Процедура ОбновитьЗаказыНаЗакупку(Команда)
	
	ЗаполнитьЗаказыНаЗакупкуНаСервере();
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьЗаказыНаЗакупкуНаСервере()
	
	Если Объект.ЗаказыНаЗакупку.Количество() > 0 Тогда
		//Объект.ЗаказыНаЗакупку.Очистить();
		//rarus vikhle 11.02.2021 mt 17197 +++
		МассивСсылочныхСтрок = Новый Массив;
		Для Каждого СтрокаТЧ Из Объект.ЗаказыНаЗакупку Цикл
			Если НЕ ТипЗнч(СтрокаТЧ.ЗаказНаЗакупку) = Тип("Строка") Тогда
				МассивСсылочныхСтрок.Добавить(СтрокаТЧ);
			КонецЕсли;	
		КонецЦикла;
		Для Каждого ЭлементМассива Из МассивСсылочныхСтрок Цикл
			Объект.ЗаказыНаЗакупку.Удалить(ЭлементМассива);
		КонецЦикла;	
		//rarus vikhle 11.02.2021 mt 17197 ---
		Объект.КузовщикиПредставление       = "";
		Объект.ЗаказыНаЗакупкуПредставление = "";
		Модифицированность = Истина;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ЗаказНаЗавод", Объект.Наименование);
	Запрос.Текст = "ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	Scan_ЗаказНаЗакупкуПродуктыКЗаказу.Ссылка КАК ЗаказНаЗакупку,
	|	Scan_ЗаказНаЗакупкуПродуктыКЗаказу.Ссылка.Поставщик КАК Кузовщик,
	//rarus vikhle 12.02.2021 mt 17197 +++
	|	Scan_ЗаказНаЗакупкуПродуктыКЗаказу.Ссылка.ДОНомерЗаказаНаЗакупку КАК ДОНомерЗаказаНаЗакупку,
	|	Scan_ЗаказНаЗакупкуПродуктыКЗаказу.Ссылка.BBНомерЗаказаНаЗакупку КАК BBНомерЗаказаНаЗакупку
	//rarus vikhle 12.02.2021 mt 17197 ---
	|ИЗ
	|	Документ.Scan_ЗаказНаЗакупку.ПродуктыКЗаказу КАК Scan_ЗаказНаЗакупкуПродуктыКЗаказу
	|ГДЕ
	|	Scan_ЗаказНаЗакупкуПродуктыКЗаказу.НомераЗаказов ПОДОБНО ""%"" + &ЗаказНаЗавод + ""%""
	|	И НЕ Scan_ЗаказНаЗакупкуПродуктыКЗаказу.Ссылка.ПометкаУдаления";
	
	РезультатЗапроса = Запрос.Выполнить();
	Если Не РезультатЗапроса.Пустой() Тогда
		//rarus vikhle 11.02.2021 mt 17197 +++
		Выборка = РезультатЗапроса.Выбрать();
		Пока Выборка.Следующий() Цикл
			нСтрокаТЧ = Объект.ЗаказыНаЗакупку.Добавить();
			ЗаполнитьЗначенияСвойств(нСтрокаТЧ,Выборка);
		КонецЦикла;	
		//rarus vikhle 11.02.2021 mt 17197 ---
		//Объект.ЗаказыНаЗакупку.Загрузить(РезультатЗапроса.Выгрузить());
		ОбновитьПредставленияКузовщикаИЗаказовНаЗакупку();
		Модифицированность = Истина;
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ОбновитьПредставленияКузовщикаИЗаказовНаЗакупку()
	
	ТаблицаЗаказыНаЗакупку = Объект.ЗаказыНаЗакупку.Выгрузить();
	
	ТаблицаКузовщиков = ТаблицаЗаказыНаЗакупку.Скопировать(,"Кузовщик");
	ТаблицаКузовщиков.Свернуть("Кузовщик");
	Объект.КузовщикиПредставление = СтрСоединить(ТаблицаКузовщиков.ВыгрузитьКолонку("Кузовщик"), ",");
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ЗаказыНаЗакупку", ТаблицаЗаказыНаЗакупку.ВыгрузитьКолонку("ЗаказНаЗакупку"));
	Запрос.УстановитьПараметр("ТаблицаЗаказыНаЗакупку",ТаблицаЗаказыНаЗакупку);//rarus vikhle 11.02.2021 mt 17197
	Запрос.Текст = "ВЫБРАТЬ
				   //rarus vikhle 11.02.2021 mt 17197 +++
	               |	ТаблицаЗаказыНаЗакупку.ЗаказНаЗакупку КАК ЗаказНаЗакупку
	               |ПОМЕСТИТЬ СтроковыеЗаказы
	               |ИЗ
	               |	&ТаблицаЗаказыНаЗакупку КАК ТаблицаЗаказыНаЗакупку
	               |ГДЕ
	               |	ТИПЗНАЧЕНИЯ(ТаблицаЗаказыНаЗакупку.ЗаказНаЗакупку) = ТИП(СТРОКА)
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
				   //rarus vikhle 11.02.2021 mt 17197 ---
				   |ВЫБРАТЬ РАЗЛИЧНЫЕ
	               |	ВЫБОР
	               |		КОГДА Scan_ЗаказНаЗакупку.ХозОперация = ЗНАЧЕНИЕ(Справочник.Scan_ХозяйственныеОперации.ЗаказНаЗакупкуЛокальный)
	               |			ТОГДА Scan_ЗаказНаЗакупку.ДОНомерЗаказаНаЗакупку
	               |		КОГДА Scan_ЗаказНаЗакупку.ХозОперация = ЗНАЧЕНИЕ(Справочник.Scan_ХозяйственныеОперации.ЗаказНаЗакупкуЕвро)
	               |			ТОГДА Scan_ЗаказНаЗакупку.BBНомерЗаказаНаЗакупку
	               |		ИНАЧЕ """"
	               |	КОНЕЦ КАК Номер
	               |ИЗ
	               |	Документ.Scan_ЗаказНаЗакупку КАК Scan_ЗаказНаЗакупку
	               |ГДЕ
	               |	Scan_ЗаказНаЗакупку.Ссылка В(&ЗаказыНаЗакупку)
	               |	И ВЫБОР
	               |			КОГДА Scan_ЗаказНаЗакупку.ХозОперация = ЗНАЧЕНИЕ(Справочник.Scan_ХозяйственныеОперации.ЗаказНаЗакупкуЛокальный)
	               |				ТОГДА Scan_ЗаказНаЗакупку.ДОНомерЗаказаНаЗакупку
	               |			КОГДА Scan_ЗаказНаЗакупку.ХозОперация = ЗНАЧЕНИЕ(Справочник.Scan_ХозяйственныеОперации.ЗаказНаЗакупкуЕвро)
	               |				ТОГДА Scan_ЗаказНаЗакупку.BBНомерЗаказаНаЗакупку
	               |			ИНАЧЕ """"
	               |		КОНЕЦ <> """"
	               |
				   //rarus vikhle 11.02.2021 mt 17197 +++
				   |ОБЪЕДИНИТЬ ВСЕ
	               |
	               |ВЫБРАТЬ
	               |	СтроковыеЗаказы.ЗаказНаЗакупку
	               |ИЗ
	               |	СтроковыеЗаказы КАК СтроковыеЗаказы
				   //rarus vikhle 11.02.2021 mt 17197 ---
				   |
	               |УПОРЯДОЧИТЬ ПО
	               |	Номер";
	
	РезультатЗапроса = Запрос.Выполнить();
	Объект.ЗаказыНаЗакупкуПредставление = СтрСоединить(РезультатЗапроса.Выгрузить().ВыгрузитьКолонку("Номер"), ",");
	
КонецПроцедуры
//rarus agar 27.08.2020 15696 --

//rarus vikhle 22.10.2020 mt 16328 +++
&НаКлиенте
Процедура ЗаказыНаЗакупкуОсновнойПриИзменении(Элемент)
	ПараметрыОтбора = Новый Структура("Основной",Истина);
	МассивОсновныхСтрок = Объект.ЗаказыНаЗакупку.НайтиСтроки(ПараметрыОтбора);
	Если МассивОсновныхСтрок.Количество() > 1 Тогда
		ТекущиеДанные = Элементы.ЗаказыНаЗакупку.ТекущиеДанные;
		ТекущиеДанные.Основной = Ложь;
		ВывестиСообщениеПол(Нстр("ru = 'В таблице уже есть строка с признаком ""Основной""'"));
	КонецЕсли;	
КонецПроцедуры
//rarus vikhle 22.10.2020 mt 16328 ---

//rarus vikhle 12.02.2021 mt 17197 +++
&НаСервере
Процедура ОбновитьКолонкиЗаказовНаЗакупку()
	
	Если Объект.ЗаказыНаЗакупку.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;	
	
	ЗаказОбъект = РеквизитФормыВЗначение("Объект");
	МассивСсылок = ЗаказОбъект.ЗаказыНаЗакупку.ВыгрузитьКолонку("ЗаказНаЗакупку");
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	Scan_ЗаказНаЗакупку.Ссылка КАК ЗаказНаЗакупку,
	               |	Scan_ЗаказНаЗакупку.ДОНомерЗаказаНаЗакупку КАК ДОНомерЗаказаНаЗакупку,
	               |	Scan_ЗаказНаЗакупку.BBНомерЗаказаНаЗакупку КАК BBНомерЗаказаНаЗакупку
	               |ИЗ
	               |	Документ.Scan_ЗаказНаЗакупку КАК Scan_ЗаказНаЗакупку
	               |ГДЕ
	               |	Scan_ЗаказНаЗакупку.Ссылка В(&МассивСсылок)";
	Запрос.УстановитьПараметр("МассивСсылок",МассивСсылок);
	РезультатЗапроса = Запрос.Выполнить();
	Выборка = РезультатЗапроса.Выбрать();
	Пока Выборка.Следующий() Цикл
		СтруктураОтбора = Новый Структура("ЗаказНаЗакупку",Выборка.ЗаказНаЗакупку);
		мСтрокТЧ = Объект.ЗаказыНаЗакупку.НайтиСтроки(СтруктураОтбора);
		Для Каждого СтрокаТЧ Из мСтрокТЧ Цикл
			ЗаполнитьЗначенияСвойств(СтрокаТЧ,Выборка); 	
		КонецЦикла;	
	КонецЦикла;	
	
КонецПроцедуры	
//rarus vikhle 12.02.2021 mt 17197 ---

////////////////////////////////////////////////////////////////////////////////																									
// ОБРАБОТЧИКИ ОСНОВНЫХ СОБЫТИЙ СПИСКА ФОРМЫ																									
																									
////////////////////////////////////////////////////////////////////////////////																									
// ИСПОЛНЯЕМАЯ ЧАСТЬ МОДУЛЯ
